# Pandas merge Fuction?

Pandas merge connects columns or indexes in DataFrame based on one or more keys.

# merge()

In [3]:
import pandas as pd

In [6]:
df1 = pd.DataFrame({"ID" : [1,2,3,4],           # It will creat a dataframe
                    "Class" : [9,10,11,12]})
df1

   ID  Class
0   1      9
1   2     10
2   3     11
3   4     12

In [14]:
df2 = pd.DataFrame({"ID" : [1,2,3],           # It will creat a dataframe
                    "Name" : ["A","B","C"]})
df2

   ID Name
0   1    A
1   2    B
2   3    C

In [15]:
pd.merge(df1,df2, on="ID") #It will merge Two dataframe

   ID  Class Name
0   1      9    A
1   2     10    B
2   3     11    C

In [16]:
pd.merge(df2,df1, on="ID")

   ID Name  Class
0   1    A      9
1   2    B     10
2   3    C     11

In [17]:
pd.merge(df1,df2, on="ID" , how = "left")

   ID  Class Name
0   1      9    A
1   2     10    B
2   3     11    C
3   4     12  NaN

In [18]:
pd.merge(df1,df2, on="ID" , how = "outer")

   ID  Class Name
0   1      9    A
1   2     10    B
2   3     11    C
3   4     12  NaN

In [19]:
pd.merge(df1,df2, on="ID" , how = "left" ,indicator= True)

   ID  Class Name     _merge
0   1      9    A       both
1   2     10    B       both
2   3     11    C       both
3   4     12  NaN  left_only

In [21]:
df1

   ID  Class
0   1      9
1   2     10
2   3     11
3   4     12

In [22]:
df2

   ID Name
0   1    A
1   2    B
2   3    C

In [23]:
pd.merge(df1,df2,left_index=True,right_index= True)

   ID_x  Class  ID_y Name
0     1      9     1    A
1     2     10     2    B
2     3     11     3    C

In [24]:
df1 = pd.DataFrame({"ID" : [1,2,3,4],           # It will creat a dataframe
                    "Class" : [9,10,11,12]})
df1

   ID  Class
0   1      9
1   2     10
2   3     11
3   4     12

In [25]:
df2 = pd.DataFrame({"ID" : [1,2,3],           # It will creat a dataframe
                    "Name" : ["A","B","C"]})
df2

   ID Name
0   1    A
1   2    B
2   3    C

In [30]:
pd.merge(df1,df1 ,on ="ID",suffixes=("_Higher" , "_Middle")) # we can add same data frame

   ID  Class_Higher  Class_Middle
0   1             9             9
1   2            10            10
2   3            11            11
3   4            12            12